print ("это supertest  по химии егэ 2023 гидролиз кто не напишет того растворим в ашхлор")
s = 0
print ("1. Расположите вещества в порядке уменьшения pH")
print ("1. K2CO3 2. KHCO3 3. FeCl3 4. KClO3")
a = int (input ())
if a == 1243:
    s += 1
    print ("молодчинка")
else:
    print ("F")

    print ("2. Расположите вещества в порядке увеличения pH")
print ("1. NH3 2. NH4Cl 3. KCl 4. KOH")
a = int (input ())
if a == 2314:
    s += 1
    print ("молодчинка")
else:
    print ("F")
    
print ("3. Расположите вещества в порядке уменьшения pH")
print ("1. Na2S 2. Na2SO4 3. H2S 4. H2SO4")
a = int (input ())
if a == 1234:
    s += 1
    print ("молодчинка")
else:
    print ("F")
    
print ("4. Расположите вещества в порядке увеличения pH")
print ("1. хлорид алюминия 2. нитрат кальция 3. сульфид натрия 4. серная кислота")
a = int (input ())
if a == 4132:
    s += 1
    print ("молодчинка")
else:
    print ("F")

    print ("5. Расположите вещества в порядке увеличения pH")
print ("1. нитрат бария 2. карбонат натрия 3. серная кислота 4. сульфат железа (III)")
a = int (input ())
if a == 3412:
    s += 1
    print ("молодчинка")
else:
    print ("F")

    print ("6. Расположите вещества в порядке увеличения pH")
print ("1. K2CO3 2. KСlO3 3. Al(NO3)3 4. RbOH")
a = int (input ())
if a == 3214:
    s += 1
    print ("молодчинка")
else:
    print ("F")

    print ("7. Расположите вещества в порядке уменьшения pH")
print ("1. MgCl2 2. Ca(OH)2 3. Ca(NO3)2 4. HClO4")
a = int (input ())
if a == 2314:
    s += 1
    print ("молодчинка")
else:
    print ("F")
    
print ("8. Расположите вещества в порядке увеличенияия pH")
print ("1. метиламин 2. аммиак 3. нитрат алюминия 4. перхлорат калия")
a = int (input ())
if a == 3421:
    s += 1
    print ("молодчинка")
else:
    print ("F")
    
print ("9. Расположите вещества в порядке увеличения pH")
print ("1. сульфит кальция 2. хлорид цезия 3. хлорид железа (III) 4. гидроксид натрия")
a = int (input ())
if a == 3214:
    s += 1
    print ("молодчинка")
else:
    print ("F")

    print ("10. Расположите вещества в порядке увеличения pH")
print ("1. HI 2. KNO2 3. HNO2 4. KNO3")
a = int (input ())
if a == 1342:
    s += 1
    print ("молодчинка")
else:
    print ("F")

if s >=0 and s <=3:
    print ("твоя оценка 2 Галина Анатольевна ждет в субботу в 7:45")

if s >=4 and s <=6:
    print ("мда бывало и хуже наверн три с минусом")

if s >=7 and s <=9:
    print ("красиво красиво умничка")

if s == 10:
    print ("ты что Любаша?")
print (s)
    








    
